[
  {
    "name": "Evan Tatara",
    "text": "Not only are all the workers at this game store consistently the most friendly and best I’ve seen in Ohio, but as someone who regularly sells and trades at this location, the deals that ultimately get made here are actually fair and not highway robbery like a lot of retro game stores tend to operate. The owners and employees here have a real sense of what it takes to turn a profit without taking advantage of and leaving their customers in the dust. If you have collectible games or cards, don’t be afraid to give this place a stop. At the worst, you’re supporting good people, and at the best, you’re going into a reliable retro game store with great atmosphere and getting some awesome stuff!",
    "rating": 5
  },
  {
    "name": "Jamin \"The Kid\" Murray",
    "text": "Great collection and great prices. Definitely a must place to go to for all game collectors and anyone looking for that missing piece to their collection. Employee's were great and knew what they were talking about. Always a great experience with both the customer and employee are passionate about it.",
    "rating": 5
  },
  {
    "name": "Ryan K",
    "text": "The crazy thing is I have never stepped foot in the store before. All of my transactions have been online. But let me tell you, they are my go-to store for video games. I have made several purchases and they have always done a great job. Good communication and willingness to go above and beyond. I never hesitate to reach out with a gaming need or refer to any of my friends. This was a no-brainer to give a 5 star review.",
    "rating": 5
  },
  {
    "name": "Ezekiel Manuel",
    "text": "I talked to Adam two times on the phone today and let me just tell you he was sooooooo nice and understanding and he helped me with the two questions that I had so thank you Adam. I will most definitely try to stop in and show you guys the games I'm trying to get rid of",
    "rating": 5
  },
  {
    "name": "Chandler Blankenship",
    "text": "Best game store for buying or selling in Mansfield always fair with there costumer's",
    "rating": 5
  },
  
  {
    "name": "mxrose_x",
    "text": "Awesome store! Always get some of my favorite singles pick-ups from here and generally very kind staff 💜 I only got back into collecting within the last few months and they've treated me with patience and alwags help me find what I need or want at great prices!",
    "rating": 5
  }
]
